In [1]:
import requests
import pandas as pd
import io

nse_url = "https://nsearchives.nseindia.com/content/equities/EQUITY_L.csv"

# create Session from 'real' browser
headers = {
    'User-Agent': 'Mozilla/5.0'
}

s = requests.Session()
s.headers.update(headers)

# do a get call now
url = 'https://nsearchives.nseindia.com/content/equities/EQUITY_L.csv'
r = s.get(nse_url)
s.close()

# saving it to pd df for further preprocessing
df_nse = pd.read_csv(io.BytesIO(r.content))

In [7]:
df_nse.head()

,SYMBOL,NAME OF COMPANY,SERIES,DATE OF LISTING,PAID UP VALUE,MARKET LOT,ISIN NUMBER,FACE VALUE
0,20MICRONS,20 Microns Limited,EQ,06-OCT-2008,5,1,INE144J01027,5
1,21STCENMGM,21st Century Management Services Limited,BE,03-MAY-1995,10,1,INE253B01015,10
2,360ONE,360 ONE WAM LIMITED,EQ,19-SEP-2019,1,1,INE466L01038,1
3,3IINFOLTD,3i Infotech Limited,EQ,22-OCT-2021,10,1,INE748C01038,10
4,3MINDIA,3M India Limited,EQ,13-AUG-2004,10,1,INE470A01017,10

In [9]:
new_df = df_nse[["SYMBOL", "NAME OF COMPANY"]]

In [10]:
new_df.head()

       SYMBOL                           NAME OF COMPANY
0   20MICRONS                        20 Microns Limited
1  21STCENMGM  21st Century Management Services Limited
2      360ONE                       360 ONE WAM LIMITED
3   3IINFOLTD                       3i Infotech Limited
4     3MINDIA                          3M India Limited

In [11]:
new_df.to_csv("NSE_companyList/NSE_securities.csv", index=False)